SolutionApps/App.Solutions/App.WebAPIConfigService/App_Data/ApiLogFiles/UserLogFiles/M9FNIKNXKW/EnhancedBookMultiSegmentRQ.log

<?xml version='1.0' encoding='UTF-8'?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sec="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:eb="http://www.ebxml.org/namespaces/messageHeader"><soapenv:Header>  <eb:MessageHeader soapenv:mustUnderstand="1" eb:version="1.0">       <eb:From>           <eb:PartyId eb:type="urn: x12.org:IO5: 01">999999</eb:PartyId>       </eb:From>       <eb:To>           <eb:PartyId type="urn:x12.org:IO5:01">123123</eb:PartyId>       </eb:To>       <eb:CPAId>3RT2</eb:CPAId>       <eb:ConversationId>1111111111111111111</eb:ConversationId>       <eb:Service eb:type="sabreXML">EnhancedAirBookRQ</eb:Service>       <eb:Action>EnhancedAirBookRQ</eb:Action>       <eb:MessageData>           <eb:MessageId>mid:0_2014-09-22T21:43:40m</eb:MessageId>           <eb:Timestamp>2014-09-22T21:43:40</eb:Timestamp>           <eb:TimeToLive>2014-09-22T21:43:40</eb:TimeToLive>       </eb:MessageData>       <eb:DuplicateElimination/>       <eb:Description>Air Book Service</eb:Description>   </eb:MessageHeader>   <sec:Security xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:wsu="http://schemas.xmlsoap.org/ws/2002/12/utility">       <sec:BinarySecurityToken></sec:BinarySecurityToken>   </sec:Security></soapenv:Header><soapenv:Body>    <EnhancedAirBookRQ  xmlns="http://services.sabre.com/sp/eab/v3_6"  version="3.6.0" IgnoreOnError="true" HaltOnError="false" >     <OTA_AirBookRQ>   <RetryRebook Option="true"/>   <HaltOnStatus Code="NO"/>   <HaltOnStatus Code="NN"/>   <HaltOnStatus Code="UC"/>   <HaltOnStatus Code="US"/>   <HaltOnStatus Code="WL"/>   <HaltOnStatus Code="HL"/>   <HaltOnStatus Code="UN"/>   <HaltOnStatus Code="PN"/>   <HaltOnStatus Code="LL"/>      <OriginDestinationInformation>   <FlightSegment DepartureDateTime="2019-07-03T20:05" ArrivalDateTime="2019-07-03T21:35" FlightNumber="1733" NumberInParty="1" ResBookDesigCode="K" Status="NN">      <DestinationLocation   LocationCode="ZRH"/>      <Equipment AirEquipType="321"/>      <MarketingAirline Code="LX" FlightNumber="1733"/>      <OperatingAirline Code="LX"/>      <OriginLocation   LocationCode="FCO"/>     </FlightSegment>   <FlightSegment DepartureDateTime="2019-07-31T11:15" ArrivalDateTime="2019-07-31T12:15" FlightNumber="1187" NumberInParty="1" ResBookDesigCode="K" Status="NN">      <DestinationLocation   LocationCode="FRA"/>      <Equipment AirEquipType="32A"/>      <MarketingAirline Code="LH" FlightNumber="1187"/>      <OperatingAirline Code="LH"/>      <OriginLocation   LocationCode="ZRH"/>     </FlightSegment>   <FlightSegment DepartureDateTime="2019-07-31T16:25" ArrivalDateTime="2019-07-31T18:15" FlightNumber="238" NumberInParty="1" ResBookDesigCode="K" Status="NN">      <DestinationLocation   LocationCode="FCO"/>      <Equipment AirEquipType="321"/>      <MarketingAirline Code="LH" FlightNumber="238"/>      <OperatingAirline Code="LH"/>      <OriginLocation   LocationCode="FRA"/>     </FlightSegment>      </OriginDestinationInformation>     <RedisplayReservation NumAttempts="2" WaitInterval="5000"/>     </OTA_AirBookRQ> <PostProcessing IgnoreAfter ="false">   <RedisplayReservation WaitInterval ="5000"/> </PostProcessing>    </EnhancedAirBookRQ>   </soapenv:Body></soapenv:Envelope>